# DimLeaderDisplayCondition Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DimLeaderDisplayCondition Property
ParameterTypeId Class See Also
---
"Show Leader When Text Moves"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DimLeaderDisplayCondition { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DimLeaderDisplayCondition As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DimLeaderDisplayCondition {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace